app/controllers/articles_controller.rb

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "image.jpg"], ["image_updated_at", "2017-09-27 04:35:59.388704"], ["updated_at", "2017-09-27 04:35:59.396560"], ["id", 1]]

	def destroy
		@article = Article.find(params[:id])
		flash.notice = "Article '#{@article.title}' removed... PERMANENTLY!"


		@article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]